#pragma region menual 

/*

// 입력 //

####################################
     오디션 후보자 데이터 입력
####################################
첫 번째 후보자의 정보를 입력합니다.
---------------------------------
1. 성명: 박지연
2. 생일(YYYY/MM/DD 형식): 2006/04/15
3. 성별(여성이면 F 또는 남성이면 M): F
4. 메일 주소: jiyeon@outlook.com
5. 국적: 한국
6. BMI: 18.5
7. 주 스킬: 댄스
8. 보조 스킬: 작곡
9. 한국어 등급(TOPIK): 0
10. MBTI: ENFJ
11. 소개: 무한한 열정과 창의성을 갖춘 댄서이자 작곡가로, 함께 꿈을 향해 달려갈 준비가 되어 있습니다.
=================================
두 번째 후보자를 입력합니다.


// 출력 //

####################################
     오디션 후보자 데이터 조회 
####################################
=============================================================================================
성   명 | 생   일 | 성별 | 메   일            | 국적 | BMI | 주스킬 | 보조스킬 | TOPIK | MBTI |       
=============================================================================================
박지연  |20060415 | 여   | jiyeon@outlook.com |한국 | 18.5 | 댄스   | 작곡    | 원어민 | ENFJ |
        -------------------------------------------------------------------------------------
무한한 열정과 창의성을 갖춘 댄서이자 작곡가로, 함께 꿈을 향해 달려갈 준비가 되어 있습니다.     |
---------------------------------------------------------------------------------------------
*/

// 후보자들의 데이터는 1 차원 배열 6개로 관리해야 한다. 
// 각 배열 이름은 “candidate##”와 같으며, 
// 이때 ##은 01~06의 순번으로 부여한다. 

// 후보자 데이터 속성은 “member_info” 배열을 사용한다.

// 후보자 6명의 데이터는 while 반복문을 사용해 입력 받아야 한다.
// 후보자 6명의 데이터 출력을 for 반복문을 사용해 출력한다.

// 표준 getchar() 함수를 사용해  
// 오디션 그룹명(예, 밀리웨이즈)을 입력 받는지 확인한다. 

/* 
오디션 후보자 입력 화면과 출력 화면이 다음과 같이 제시되는지 확인한다.
####################################
[밀리웨이즈] 오디션 후보자 데이터 입력
####################################
첫 번째 후보자의 정보를 입력합니다.
---------------------------------
........

####################################
[밀리웨이즈] 오디션 후보자 데이터 조회 
####################################
.........
*/

// 성명 열의 이름 다음에 만 나이를 표시하는지 확인한다. 
// 생일 열의 데이터를 만 나이로 계산하는 코드를 구현했는지 확인한다.
// 출력 예시:  “박지연(17)”


#pragma endregion

int main()
{

    
    return 0;
}